# DataFrameの作成

In [2]:
import pandas as pd
pd.DataFrame({
    '名前':['佐藤','斎藤','鈴木'],
    '年齢':['21','18','30'],
    '住所':['東京都','岐阜県','埼玉県'],
    '血液型':['A','AB','O']
})

   名前  年齢   住所 血液型
0  佐藤  21  東京都   A
1  斎藤  18  岐阜県  AB
2  鈴木  30  埼玉県   O

In [3]:
import pandas as pd
pd.DataFrame({
    '名前':['佐藤','斎藤','鈴木'],
    '年齢':['21','18','30'],
    '住所':['東京都','岐阜県','埼玉県'],
    '血液型':['A','AB','O']
},index=['i-1','i-2','i-3'])

     名前  年齢   住所 血液型
i-1  佐藤  21  東京都   A
i-2  斎藤  18  岐阜県  AB
i-3  鈴木  30  埼玉県   O

In [4]:
import pandas as pd
pd.Series(['佐藤','斎藤','鈴木'])

0    佐藤
1    斎藤
2    鈴木
dtype: object

In [5]:
import pandas as pd
pd.read_excel('user_data.xlsx')

  ユーザーID  最高スコア  平均スコア
0  id001    900    530
1  id002    720    490
2  id003    980    510
3  id004    890    590

# 読み込んだエクセルファイルにindexを指定する

In [7]:
import pandas as pd
pd.read_excel('user_data.xlsx', index_col='ユーザーID')

        最高スコア  平均スコア
ユーザーID
id001     900    530
id002     720    490
id003     980    510
id004     890    590

# エクセルの2シート目などを読み込みたい場合

In [8]:
import pandas as pd
pd.read_excel('user_data.xlsx', sheet_name='2月')

  ユーザーID  最高スコア  平均スコア
0  id001   1000    630
1  id002    820    590
2  id003   1080    610
3  id004    990    690

# ファイルの読み込み
pd.read_json(ファイルパス)    jsonデータ<br>
pd.read_xml(ファイルパス)     xmlデータ<br>
pd.read_pickle(ファイルパス)  pickleデータ<br>
pd.read_html(ファイルパス)    htmlデータ<br>

# データフレームに対する操作について

In [ ]:
# 特定の列や行を抽出
import pandas as pd
df.pd.read_csv('XXX.csv')
df.loc[インデックスの値のリスト, カラム名のリスト]
df.iloc[行の位置の番号, 列の位置の番号]

In [9]:
import pandas as pd
df = pd.read_excel('user_data.xlsx')
display(df)

  ユーザーID  最高スコア  平均スコア
0  id001    900    530
1  id002    720    490
2  id003    980    510
3  id004    890    590

In [11]:
df.loc[[0,3],['ユーザーID','最高スコア']]

  ユーザーID  最高スコア
0  id001    900
3  id004    890

In [12]:
df.loc[:,['ユーザーID','最高スコア']]

  ユーザーID  最高スコア
0  id001    900
1  id002    720
2  id003    980
3  id004    890

In [16]:
import pandas as pd
df = pd.read_excel('user_data.xlsx')
display(df)
df['最高スコア'] + df['平均スコア']

  ユーザーID  最高スコア  平均スコア
0  id001    900    530
1  id002    720    490
2  id003    980    510
3  id004    890    590

0    1430
1    1210
2    1490
3    1480
dtype: int64

In [18]:
df['新ポイント'] = df['最高スコア'] + df['平均スコア']
display(df)

  ユーザーID  最高スコア  平均スコア  新ポイント
0  id001    900    530   1430
1  id002    720    490   1210
2  id003    980    510   1490
3  id004    890    590   1480